src/main/java/ru/vk/itmo/test/timofeevkirill/results/task2/wrk2/put/h_950_000rps_24threads_3072linked_64connections
./wrk -d 2m -t 8 -c 64 -R 950000 -s /home/aphirri/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/timofeevkirill/scripts/lua/put.lua -L http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  8 threads and 64 connections
  Thread calibration: mean lat.: 7.455ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 12.277ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 6.861ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 11.892ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 7.690ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 14.057ms, rate sampling interval: 89ms
  Thread calibration: mean lat.: 12.602ms, rate sampling interval: 80ms
  Thread calibration: mean lat.: 10.751ms, rate sampling interval: 66ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   385.91ms  511.96ms   1.92s    79.17%
    Req/Sec   119.99k    22.98k  175.29k    80.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.77ms
 75.000%  792.06ms
 90.000%    1.19s
 99.000%    1.72s
 99.900%    1.85s
 99.990%    1.90s
 99.999%    1.91s
100.000%    1.92s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.009     0.000000            1         1.00
       0.596     0.100000     10463905         1.11
       1.155     0.200000     20897966         1.25
       2.383     0.300000     31342534         1.43
       7.523     0.400000     41789407         1.67
      21.775     0.500000     52234626         2.00
      48.735     0.550000     57457754         2.22
     251.135     0.600000     62679253         2.50
     468.735     0.650000     67905140         2.86
     655.871     0.700000     73134789         3.33
     792.063     0.750000     78369739         4.00
     855.039     0.775000     80973958         4.44
     918.527     0.800000     83573009         5.00
     981.503     0.825000     86185412         5.71
    1043.455     0.850000     88799821         6.67
    1111.039     0.875000     91428574         8.00
    1146.879     0.887500     92719134         8.89
    1189.887     0.900000     94043480        10.00
    1245.183     0.912500     95339704        11.43
    1304.575     0.925000     96648118        13.33
    1363.967     0.937500     97938534        16.00
    1397.759     0.943750     98592940        17.78
    1430.527     0.950000     99258667        20.00
    1466.367     0.956250     99901446        22.86
    1500.159     0.962500    100546311        26.67
    1537.023     0.968750    101203049        32.00
    1553.407     0.971875    101528478        35.56
    1572.863     0.975000    101864722        40.00
    1595.391     0.978125    102183406        45.71
    1618.943     0.981250    102505840        53.33
    1648.639     0.984375    102838990        64.00
    1666.047     0.985938    102996038        71.11
    1685.503     0.987500    103165077        80.00
    1703.935     0.989062    103322335        91.43
    1722.367     0.990625    103494515       106.67
    1734.655     0.992188    103654209       128.00
    1740.799     0.992969    103730269       142.22
    1748.991     0.993750    103810721       160.00
    1758.207     0.994531    103893422       182.86
    1770.495     0.995313    103978279       213.33
    1784.831     0.996094    104060550       256.00
    1790.975     0.996484    104102271       284.44
    1797.119     0.996875    104137677       320.00
    1804.287     0.997266    104178608       365.71
    1812.479     0.997656    104219345       426.67
    1821.695     0.998047    104261640       512.00
    1825.791     0.998242    104281877       568.89
    1830.911     0.998437    104304549       640.00
    1836.031     0.998633    104321129       731.43
    1843.199     0.998828    104343393       853.33
    1849.343     0.999023    104363630      1024.00
    1852.415     0.999121    104372378      1137.78
    1856.511     0.999219    104382096      1280.00
    1862.655     0.999316    104394063      1462.86
    1866.751     0.999414    104403406      1706.67
    1870.847     0.999512    104414372      2048.00
    1872.895     0.999561    104419102      2275.56
    1874.943     0.999609    104423094      2560.00
    1879.039     0.999658    104428506      2925.71
    1882.111     0.999707    104433389      3413.33
    1885.183     0.999756    104438567      4096.00
    1887.231     0.999780    104441599      4551.11
    1889.279     0.999805    104444013      5120.00
    1891.327     0.999829    104445729      5851.43
    1893.375     0.999854    104448337      6826.67
    1896.447     0.999878    104451324      8192.00
    1897.471     0.999890    104452599      9102.22
    1898.495     0.999902    104453908     10240.00
    1899.519     0.999915    104454831     11702.86
    1901.567     0.999927    104456647     13653.33
    1902.591     0.999939    104457619     16384.00
    1903.615     0.999945    104458570     18204.44
    1903.615     0.999951    104458570     20480.00
    1904.639     0.999957    104459410     23405.71
    1905.663     0.999963    104459817     27306.67
    1907.711     0.999969    104460976     32768.00
    1907.711     0.999973    104460976     36408.89
    1907.711     0.999976    104460976     40960.00
    1908.735     0.999979    104461594     46811.43
    1908.735     0.999982    104461594     54613.33
    1910.783     0.999985    104462069     65536.00
    1910.783     0.999986    104462069     72817.78
    1911.807     0.999988    104462295     81920.00
    1912.831     0.999989    104462490     93622.86
    1913.855     0.999991    104462775    109226.67
    1913.855     0.999992    104462775    131072.00
    1913.855     0.999993    104462775    145635.56
    1914.879     0.999994    104463093    163840.00
    1914.879     0.999995    104463093    187245.71
    1914.879     0.999995    104463093    218453.33
    1914.879     0.999996    104463093    262144.00
    1915.903     0.999997    104463349    291271.11
    1915.903     0.999997    104463349    327680.00
    1915.903     0.999997    104463349    374491.43
    1915.903     0.999998    104463349    436906.67
    1915.903     0.999998    104463349    524288.00
    1915.903     0.999998    104463349    582542.22
    1915.903     0.999998    104463349    655360.00
    1915.903     0.999999    104463349    748982.86
    1916.927     0.999999    104463442    873813.33
    1916.927     0.999999    104463442   1048576.00
    1916.927     0.999999    104463442   1165084.44
    1916.927     0.999999    104463442   1310720.00
    1916.927     0.999999    104463442   1497965.71
    1916.927     0.999999    104463442   1747626.67
    1916.927     1.000000    104463442   2097152.00
    1916.927     1.000000    104463442   2330168.89
    1916.927     1.000000    104463442   2621440.00
    1916.927     1.000000    104463442   2995931.43
    1916.927     1.000000    104463442   3495253.33
    1917.951     1.000000    104463471   4194304.00
    1917.951     1.000000    104463471          inf
#[Mean    =      385.914, StdDeviation   =      511.959]
#[Max     =     1916.928, Total count    =    104463471]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  113978958 requests in 2.00m, 7.11GB read
Requests/sec: 949832.84
Transfer/sec:     60.69MB